# encoding=utf-8
import sys

reload(sys)
sys.setdefaultencoding('utf-8')

import bangla_pos_tagger
file = open("test.txt","w")
# from nltk.tag import AffixTagger
# tagger= AffixTagger(train_sents)
#tagger.evaluate("test_sents")



btagger=bangla_pos_tagger.BanglaTagger()
a=" আমি তোমা ূল ঘটনা আসি  আমা বাড়ির পাশ অদূর বাঁশঝাড় আর ত ঠিক পাশ এক বুড়ির ছোট্ট কুঁড়েঘর বুড়ি আম “আমিরুল নানী” বল চিনি স কুঁড়েঘর বুড়ি আর ত বুড়া থা বুড়ির চার ছাল দুই মা মেয়ে বি হ গ আর ছাল বি কর দুর বাসা বানি আলাদা থা তা ভূল বুড়ি আর বুড়া দেখ আসেনা  বুড়া আম পিচ্চি সব সম এক মাদুর উপর শু থাক দেখি বারান্দা এক কাঁথা গা দি চিৎপটাং হ পর থা কোন নড়ন চড়ন দেখিনি কখনো বুড়ি ক প্রা সম আম এক অদ্ভুত কাজ কর দেখতাম তা হলো পুকুর পাশ নষ্ট ব্যাটারীর স্তুপ থাক আর স নষ্ট ব্যাটারী গুলা বুড়ি এক ছোট্ট হাতুড়ি দি ভাঙ পর জেনেছিলাম বুড়ি নিজ কোথা থ ওসব ব্যাটারী জোগাড় কর আন তারপর হাতুড়ি দি ভাঙ ব্যাটারী গুল মাথা য পিতল টুপি বা ক্যাপ থা ও ব কর জমা একবার অনেক গুলা হল বুড়ি সেগুলা বিক্রি কর  তব বুড়ির আরেক কাজ ছিল তা হলো স এক ছোট্ট ঢাকি (বাঁশ দি বানানো ঝুরি) ত কর কিছু আলতা চুড়ি রঙ্গিন ফিতা ব্যান্ড সুঁ চিরুনী টিপ আরো অনেক কিছু নি পাড়া পাড়া ঘুর বেড়া এভাব বল “নিব নাকি মাগো আলতা চিরুনী খোপা টিপ...কম পয়সা দিয়া দিমুন মা গো...নিব নাকি?” এভাব সেগুলা বিক্রি কর কোন কোনদিন দেখা যেত স কোথা থ কিছু নষ্ট ব্যাটারী যোগাড় কর সেগুলা নি এস স ব্যাটারীর স্তুপ ফাল হাতুড়ি দি ভাঙ  আম সেখান ভিড় করতাম ব্যাটারির চক লোভ আসল য কালো কার্বন দন্ড উপর পিতল টুপি বসানো থা সে আম চক বল ডাকতাম তো স দন্ড টা নি আম এক দালান বাড়ি ছিল ত গা আঁকিবুঁকি করতাম অবশ্য স দালান বাড়ির মালিক চোখ এড়ি  তো বুড়ির স্বামী ছিলো অসুস্থ তা সব সম কাঁথা গা দি পর থাক বারান্দা এবং সব কিছু বুড়ি একা সামলা হ যেমন সকাল বুড় পায়খানা-প্রস্রাব পরিষ্ক ক ঘর দোর ঝাড়ু দেয়া রান্না কর বুড়া ক খাওয়ানো নিজ কিছু মুখ দি স হরেক রকম জিনিস ভর্তি ঢাকি নি বেরি প এবং দুপুর এস সকাল রান্না কর রাখা খাব বুড়া খাওয়ানো তারপর আব বেরি প এবং বিকাল এস ব্যাটারী ভাঙা ইত্যাদী বুড়ির য জিনিস আমা ভাল লাগ তা হলো ত মুখ এক দাঁত ছিলো না তা যখন কথা বল এবং হাস তখন তা দেখ মজা লাগ আর ত ঠুকঠুক কর হাঁটা ক জানি ভাল লাগ আমা পিচ্চি ূল ঘটনা আসি  আমা বাড়ির পাশ অদূর বাঁশঝাড় আর ত ঠিক পাশ এক বুড়ির ছোট্ট কুঁড়েঘর বুড়ি আম “আমিরুল নানী” বল চিনি স কুঁড়েঘর বুড়ি আর ত বুড়া থা বুড়ির চার ছাল দুই মা মেয়ে বি হ গ আর ছাল বি কর দুর বাসা বানি আলাদা থা তা ভূল বুড়ি আর বুড়া দেখ আসেনা  বুড়া আম পিচ্চি সব সম এক মাদুর উপর শু থাক দেখি বারান্দা এক কাঁথা গা দি চিৎপটাং হ পর থা কোন নড়ন চড়ন দেখিনি কখনো বুড়ি ক প্রা সম আম এক অদ্ভুত কাজ কর দেখতাম তা হলো পুকুর পাশ নষ্ট ব্যাটারীর স্তুপ থাক আর স নষ্ট ব্যাটারী গুলা বুড়ি এক ছোট্ট হাতুড়ি দি ভাঙ পর জেনেছিলাম বুড়ি নিজ কোথা থ ওসব ব্যাটারী জোগাড় কর আন তারপর হাতুড়ি দি ভাঙ ব্যাটারী গুল মাথা য পিতল টুপি বা ক্যাপ থা ও ব কর জমা একবার অনেক গুলা হল বুড়ি সেগুলা বিক্রি কর  তব বুড়ির আরেক কাজ ছিল তা হলো স এক ছোট্ট ঢাকি (বাঁশ দি বানানো ঝুরি) ত কর কিছু আলতা চুড়ি রঙ্গিন ফিতা ব্যান্ড সুঁ চিরুনী টিপ আরো অনেক কিছু নি পাড়া পাড়া ঘুর বেড়া এভাব বল “নিব নাকি মাগো আলতা চিরুনী খোপা টিপ...কম পয়সা দিয়া দিমুন মা গো...নিব নাকি?” এভাব সেগুলা বিক্রি কর কোন কোনদিন দেখা যেত স কোথা থ কিছু নষ্ট ব্যাটারী যোগাড় কর সেগুলা নি এস স ব্যাটারীর স্তুপ ফাল হাতুড়ি দি ভাঙ  আম সেখান ভিড় করতাম ব্যাটারির চক লোভ আসল য কালো কার্বন দন্ড উপর পিতল টুপি বসানো থা সে আম চক বল ডাকতাম তো স দন্ড টা নি আম এক দালান বাড়ি ছিল ত গা আঁকিবুঁকি করতাম অবশ্য স দালান বাড়ির মালিক চোখ এড়ি  তো বুড়ির স্বামী ছিলো অসুস্থ তা সব সম কাঁথা গা দি পর থাক বারান্দা এবং সব কিছু বুড়ি একা সামলা হ যেমন সকাল বুড় পায়খানা-প্রস্রাব পরিষ্ক ক ঘর দোর ঝাড়ু দেয়া রান্না কর বুড়া ক খাওয়ানো নিজ কিছু মুখ দি স হরেক রকম জিনিস ভর্তি ঢাকি নি বেরি প এবং দুপুর এস সকাল রান্না কর রাখা খাব বুড়া খাওয়ানো তারপর আব বেরি প এবং বিকাল এস ব্যাটারী ভাঙা ইত্যাদী বুড়ির য জিনিস আমা ভাল লাগ তা হলো ত মুখ এক দাঁত ছিলো না তা যখন কথা বল এবং হাস তখন তা দেখ মজা লাগ আর ত ঠুকঠুক কর হাঁটা ক জানি ভাল লাগ আমা পিচ্চি ভালবাসি "
query=["","আমি","তোমা","ূল","ঘটনা","আসি","","আমা","বাড়ির","পাশ","অদূর","বাঁশঝাড়","আর","ত","ঠিক","পাশ","এক","বুড়ির","ছোট্ট","কুঁড়েঘর","বুড়ি","আম","“আমিরুল","নানী”","বল","চিনি","স","কুঁড়েঘর","বুড়ি","আর","ত","বুড়া","থা","বুড়ির","চার","ছাল","দুই","মা","মেয়ে","বি","হ","গ","আর","ছাল","বি","কর","দুর","বাসা","বানি","আলাদা","থা","তা","ভূল","বুড়ি","আর","বুড়া","দেখ","আসেনা","","বুড়া","আম","পিচ্চি","সব","সম","এক","মাদুর","উপর","শু","থাক","দেখি","বারান্দা","এক","কাঁথা","গা","দি","চিৎপটাং","হ","পর","থা","কোন","নড়ন","চড়ন","দেখিনি","কখনো","বুড়ি","ক","প্রা","সম","আম","এক","অদ্ভুত","কাজ","কর","দেখতাম","তা","হলো","পুকুর","পাশ","নষ্ট","ব্যাটারীর","স্তুপ","থাক","আর","স","নষ্ট","ব্যাটারী","গুলা","বুড়ি","এক","ছোট্ট","হাতুড়ি","দি","ভাঙ","পর","জেনেছিলাম","বুড়ি","নিজ","কোথা","থ","ওসব","ব্যাটারী","জোগাড়","কর","আন","তারপর","হাতুড়ি","দি","ভাঙ","ব্যাটারী","গুল","মাথা","য","পিতল","টুপি","বা","ক্যাপ","থা","ও","ব","কর","জমা","একবার","অনেক","গুলা","হল","বুড়ি","সেগুলা","বিক্রি","কর","","তব","বুড়ির","আরেক","কাজ","ছিল","তা","হলো","স","এক","ছোট্ট","ঢাকি","(বাঁশ","দি","বানানো","ঝুরি)","ত","কর","কিছু","আলতা","চুড়ি","রঙ্গিন","ফিতা","ব্যান্ড","সুঁ","চিরুনী","টিপ","আরো","অনেক","কিছু","নি","পাড়া","পাড়া","ঘুর","বেড়া","এভাব","বল","“নিব","নাকি","মাগো","আলতা","চিরুনী","খোপা","টিপ...কম","পয়সা","দিয়া","দিমুন","মা","গো...নিব","নাকি?”","এভাব","সেগুলা","বিক্রি","কর","কোন","কোনদিন","দেখা","যেত","স","কোথা","থ","কিছু","নষ্ট","ব্যাটারী","যোগাড়","কর","সেগুলা","নি","এস","স","ব্যাটারীর","স্তুপ","ফাল","হাতুড়ি","দি","ভাঙ","","আম","সেখান","ভিড়","করতাম","ব্যাটারির","চক","লোভ","আসল","য","কালো","কার্বন","দন্ড","উপর","পিতল","টুপি","বসানো","থা","সে","আম","চক","বল","ডাকতাম","তো","স","দন্ড","টা","নি","আম","এক","দালান","বাড়ি","ছিল","ত","গা","আঁকিবুঁকি","করতাম","অবশ্য","স","দালান","বাড়ির","মালিক","চোখ","এড়ি","","তো","বুড়ির","স্বামী","ছিলো","অসুস্থ","তা","সব","সম","কাঁথা","গা","দি","পর","থাক","বারান্দা","এবং","সব","কিছু","বুড়ি","একা","সামলা","হ","যেমন","সকাল","বুড়","পায়খানা-প্রস্রাব","পরিষ্ক","ক","ঘর","দোর","ঝাড়ু","দেয়া","রান্না","কর","বুড়া","ক","খাওয়ানো","নিজ","কিছু","মুখ","দি","স","হরেক","রকম","জিনিস","ভর্তি","ঢাকি","নি","বেরি","প","এবং","দুপুর","এস","সকাল","রান্না","কর","রাখা","খাব","বুড়া","খাওয়ানো","তারপর","আব","বেরি","প","এবং","বিকাল","এস","ব্যাটারী","ভাঙা","ইত্যাদী","বুড়ির","য","জিনিস","আমা","ভাল","লাগ","তা","হলো","ত","মুখ","এক","দাঁত","ছিলো","না","তা","যখন","কথা","বল","এবং","হাস","তখন","তা","দেখ","মজা","লাগ","আর","ত","ঠুকঠুক","কর","হাঁটা","ক","জানি","ভাল","লাগ","আমা","পিচ্চি","ূল","ঘটনা","আসি","","আমা","বাড়ির","পাশ","অদূর","বাঁশঝাড়","আর","ত","ঠিক","পাশ","এক","বুড়ির","ছোট্ট","কুঁড়েঘর","বুড়ি","আম","“আমিরুল","নানী”","বল","চিনি","স","কুঁড়েঘর","বুড়ি","আর","ত","বুড়া","থা","বুড়ির","চার","ছাল","দুই","মা","মেয়ে","বি","হ","গ","আর","ছাল","বি","কর","দুর","বাসা","বানি","আলাদা","থা","তা","ভূল","বুড়ি","আর","বুড়া","দেখ","আসেনা","","বুড়া","আম","পিচ্চি","সব","সম","এক","মাদুর","উপর","শু","থাক","দেখি","বারান্দা","এক","কাঁথা","গা","দি","চিৎপটাং","হ","পর","থা","কোন","নড়ন","চড়ন","দেখিনি","কখনো","বুড়ি","ক","প্রা","সম","আম","এক","অদ্ভুত","কাজ","কর","দেখতাম","তা","হলো","পুকুর","পাশ","নষ্ট","ব্যাটারীর","স্তুপ","থাক","আর","স","নষ্ট","ব্যাটারী","গুলা","বুড়ি","এক","ছোট্ট","হাতুড়ি","দি","ভাঙ","পর","জেনেছিলাম","বুড়ি","নিজ","কোথা","থ","ওসব","ব্যাটারী","জোগাড়","কর","আন","তারপর","হাতুড়ি","দি","ভাঙ","ব্যাটারী","গুল","মাথা","য","পিতল","টুপি","বা","ক্যাপ","থা","ও","ব","কর","জমা","একবার","অনেক","গুলা","হল","বুড়ি","সেগুলা","বিক্রি","কর","","তব","বুড়ির","আরেক","কাজ","ছিল","তা","হলো","স","এক","ছোট্ট","ঢাকি","(বাঁশ","দি","বানানো","ঝুরি)","ত","কর","কিছু","আলতা","চুড়ি","রঙ্গিন","ফিতা","ব্যান্ড","সুঁ","চিরুনী","টিপ","আরো","অনেক","কিছু","নি","পাড়া","পাড়া","ঘুর","বেড়া","এভাব","বল","“নিব","নাকি","মাগো","আলতা","চিরুনী","খোপা","টিপ...কম","পয়সা","দিয়া","দিমুন","মা","গো...নিব","নাকি?”","এভাব","সেগুলা","বিক্রি","কর","কোন","কোনদিন","দেখা","যেত","স","কোথা","থ","কিছু","নষ্ট","ব্যাটারী","যোগাড়","কর","সেগুলা","নি","এস","স","ব্যাটারীর","স্তুপ","ফাল","হাতুড়ি","দি","ভাঙ","","আম","সেখান","ভিড়","করতাম","ব্যাটারির","চক","লোভ","আসল","য","কালো","কার্বন","দন্ড","উপর","পিতল","টুপি","বসানো","থা","সে","আম","চক","বল","ডাকতাম","তো","স","দন্ড","টা","নি","আম","এক","দালান","বাড়ি","ছিল","ত","গা","আঁকিবুঁকি","করতাম","অবশ্য","স","দালান","বাড়ির","মালিক","চোখ","এড়ি","","তো","বুড়ির","স্বামী","ছিলো","অসুস্থ","তা","সব","সম","কাঁথা","গা","দি","পর","থাক","বারান্দা","এবং","সব","কিছু","বুড়ি","একা","সামলা","হ","যেমন","সকাল","বুড়","পায়খানা-প্রস্রাব","পরিষ্ক","ক","ঘর","দোর","ঝাড়ু","দেয়া","রান্না","কর","বুড়া","ক","খাওয়ানো","নিজ","কিছু","মুখ","দি","স","হরেক","রকম","জিনিস","ভর্তি","ঢাকি","নি","বেরি","প","এবং","দুপুর","এস","সকাল","রান্না","কর","রাখা","খাব","বুড়া","খাওয়ানো","তারপর","আব","বেরি","প","এবং","বিকাল","এস","ব্যাটারী","ভাঙা","ইত্যাদী","বুড়ির","য","জিনিস","আমা","ভাল","লাগ","তা","হলো","ত","মুখ","এক","দাঁত","ছিলো","না","তা","যখন","কথা","বল","এবং","হাস","তখন","তা","দেখ","মজা","লাগ","আর","ত","ঠুকঠুক","কর","হাঁটা","ক","জানি","ভাল","লাগ","আমা","পিচ্চি","ভালবাসি ",]
len=len(a)
start=0
end=-1
for i in range(0,len):
    if(a[i]==' ' or i==len-1):
        end=i
    if(end!=-1):
        b="\""
        if(end==len-1):
            b+=a[start:end+1]
        else:
            b+=a[start:end]
        b+="\","
        file.write(b)
        #print b
        #query.append(b)
        start=end+1;
        end=-1;
file.close()

for v in query:
    print v
    print btagger.get_tag(v)
#  "হ্যা" খুব খেতে ইচ্ছে করছে আজ...
#  ওহ...আল্লাহ আমার দিকে মুখ তুলে তাকিয়েছেন আজ! আমার ছেলে খাবে আম...
#  কি হইছে? দাও না...
#  দাঁড়া দিচ্ছি...
# আমি আম চাওয়াতে আম্মুর খুশি হওয়াটাই স্বাভাবিক ছিল। কারন এই জিনিসটা আমার একদমই ভাল লাগতো না। আম্মু বলতো, “গাছের লটকানো ফল, হলুদ মৌসুমি ফল খেতে হয়”]
#print btagger.pos_tag(query)
# term is a single Bengali Term
# for v in query:
#     print v+" "+btagger.get_tag(v)+"\n"
